module.exports.run = (bot,msg,args) => {
let t1 = 'Информация - все что нас окружает'
let t2 = 'Информация для человека - это совокупность сигналов, воспринимаемых человеком непосредственно или с помощью специальных устройств'
let t3 = 'Информация Объективна - если она не зависит от чьего либо мнения, суждения'
let t4 = 'Информация достоверна - если она отражает истинное положение дел'
let t5 = 'Информация полна - если её достаточно для понимания ситуации и принятия решения'
let t6 = 'Информация актуальна - если она существенна для настоящего времени'
let t7 = 'Информация понятно - если она выражена на языке доступном для получателя'
let t8 = 'Виды информации - визуальная, вкусовая, обонятельная'
let t9 = 'Информационный процесс = это процесс, в ходе которого изменяется содержание информации или форма её представления'
let t10 = 'Информационные процессы: 1.Сбор 2.Передача 3.Обработка 4.Хранение'
let t11 = 'Представление информации(алфавитный подход): 1.Знаковые системы-совокупность знаков 2.Определенного типа 3.Естественный язык 4.Формальный язык-знаковая система(правила граматики и синтаксиса'
let t12 = 'Виды сигналов: 1.Дискретный 2.Непрерывный'
let t13 = 'П.О. - совокупность всех программ установленных на пк'
let t14 = 'Уровни П.О. 1.Пользовательский 2.Системный'
let t15 = 'Формулы: 1.N=2^i(N-мощность алфафита, 2^i- разрядность двоичного кода) 2.I=k*i(I-инф объем сообщения, k-кол-во символов, i-вес 1 символа 3.I=Vt(V-скорость передачи по каналу связи)'
let t16 = 'Системы счисления: 1.Позиционные(вес символы зависят от его размещения) 2.Непозиционные(вес каждого символа не зависит от его позиции) 3.Унитарные(непозиционные)'
let t17 = 'Законы: 1.Двойное отрицание(если дважды отрицать некоторое высказывание, то в результате получим исходное высказывание) 2.Исключение третьего 3.Операции с константами 4.Повторения 5.Поглащение 6.Переместительный 7.Сочинительный 8.Расприделительный 9.Закон де Морграна'
let t18 = 'Конъюкция - логическая операция, ставящая в соответствии каждым двум высказываниям новое высказывание, являющеяся истиным тогда и только тогда, когда оба исходных высказывания истинны'
let t19 = 'Дизъюкция - логическая операция, которая каждым двум высказываниям ставит в соответствии новое высказывание являющееся ложным только и только тогда, когда оба исходных высказывания ложны'
let t20 = 'Инверсия - логическая операция, которая каждому высказыванию ставит в соответствии новое высказывание, значение которого противоположно исходному'
let t21 = 'Алгебра логики - определяет правила записи, вычисления значения, упрощения и преобразования высказывания'
let t22 = 'Свойства алгоритмов: 1.Дискретность(разделение на отдельные элементарные действия) 2.Упорядоченность(строгий порядок выполнения действий) 3.Определенность(однозначность результата при задании исходных данных) 4.Массовость(пригодность для решения целого класса задач) 5.Полезность(однозначное понимание и исполнение каждого шага алгоритма его исполнителем) 6.Результативность(обязательное получение результата за конечное число шагов)'
let t23 = 'Конструкция блок схемы: 1.Терминатор(пуск-остановка) 2.Процесс 3.Решение 4.Предопределенный процесс 5.Данные(ввод-вывод)'

msg.channel.send(`${t1}`)
msg.channel.send(`${t2}`)
msg.channel.send(`${t3}`)
msg.channel.send(`${t4}`)
msg.channel.send(`${t5}`)
msg.channel.send(`${t6}`)
msg.channel.send(`${t7}`)
msg.channel.send(`${t8}`)
msg.channel.send(`${t9}`)
msg.channel.send(`${t10}`)
msg.channel.send(`${t11}`)
msg.channel.send(`${t12}`)
msg.channel.send(`${t13}`)
msg.channel.send(`${t14}`)
msg.channel.send(`${t15}`)
msg.channel.send(`${t16}`)
msg.channel.send(`${t17}`)
msg.channel.send(`${t18}`)
msg.channel.send(`${t19}`)
msg.channel.send(`${t20}`)
msg.channel.send(`${t21}`)
msg.channel.send(`${t22}`)
msg.channel.send(`${t23}`)
}